Revit 2026 API

# ConnectorDirection Property

---

The direction of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FlowDirectionType Direction { get; }
```
```vb
Public ReadOnly Property Direction As FlowDirectionType
	Get
```
```cpp
public:
property FlowDirectionType Direction {
	FlowDirectionType get ();
}
```
```fsharp
member Direction : FlowDirectionType with get
```

#### Property Value

FlowDirectionType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This connector does not support flow calculation and associated properties. |

Instantaneous direction of this connector, calculated according to system.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace